{
  "duas": [
    "O Allah, guide me to the straight path.",
    "O Allah, grant me patience and strength.",
    "O Allah, forgive my sins and accept my good deeds.",
    "O Allah, make me grateful to You, mindful of You, full of fear towards You, devoted to You, humble before You.",
    "O Allah, I seek refuge in You from anxiety and grief.",
    "O Allah, I seek refuge in You from incapacity and laziness.",
    "O Allah, I seek refuge in You from cowardice and miserliness.",
    "O Allah, I seek refuge in You from being overwhelmed by debt and overpowered by men.",
    "O Allah, make the beginning of this day good, the middle prosperous, and the end successful.",
    "O Allah, by You we enter the morning and by You we enter the evening, by You we live and die and to You is the resurrection.",
    "O Allah, I ask You for knowledge that is beneficial, provision that is wholesome, and deeds that are acceptable.",
    "O Allah, protect me from what I fear and from what I am afraid of.",
    "O Allah, suffice me with what You have made lawful against what You have made unlawful, and make me independent of all others besides You.",
    "O Allah, grant me love for You and love for those who love You, and love for every action that will bring me closer to You.",
    "O Allah, I seek refuge in You from knowledge that does not benefit, from a heart that does not fear, from a soul that is not satisfied, and from a supplication that is not answered.",
    "O Allah, purify my heart from hypocrisy, my actions from showing off, my tongue from lies, and my eyes from betrayal.",
    "O Allah, I ask You for the best of this world and the best of the Hereafter.",
    "O Allah, make us among those who repent, purify themselves, and are Your righteous servants.",
    "O Allah, grant us good in this world and good in the Hereafter, and save us from the torment of the Fire.",
    "O Allah, make the Quran the spring of my heart, the light of my chest, the remover of my sadness, and the reliever of my anxiety.",
    "O Allah, I seek refuge in You from the punishment of the grave, from the trials of life and death, and from the evil of the False Messiah.",
    "O Allah, grant me wellness in my religion, my worldly life, my family, and my wealth.",
    "O Allah, cover my faults, calm my fears, protect me from my front, behind, right, left, and above, and I seek refuge in Your greatness from being taken from below.",
    "O Allah, make me content with what You have provided me, send blessings for me therein, and compensate me with something better for what You have deprived me of.",
    "O Allah, help me to remember You, thank You, and worship You properly.",
    "O Allah, I ask You for steadfastness in faith and determination in guidance.",
    "O Allah, I ask You for beneficial knowledge, good provision, and acceptable deeds.",
    "O Allah, beautify my character as You have beautified my creation.",
    "O Allah, I seek refuge in You from poverty, scarcity, and humiliation, and I seek refuge in You from oppressing and being oppressed.",
    "O Allah, grant me health in my body, sight in my eyes, hearing in my ears, and strength in my limbs.",
    "O Allah, I seek refuge in You from laziness, senility, debt, and sin.",
    "O Allah, make me love faith and beautify it in my heart, and make me hate disbelief, transgression, and disobedience.",
    "O Allah, I ask You for guidance, piety, chastity, and independence.",
    "O Allah, I ask You for pardon and wellness in my religion, my worldly affairs, my family, and my wealth.",
    "O Allah, strengthen my faith, expand my sustenance, make me of the rightly guided, and protect me from all evil.",
    "O Allah, I ask You for Paradise and seek refuge in You from the Fire.",
    "O Allah, make me among those who remember You often, thank You much, obey You, and humble themselves before You.",
    "O Allah, grant me success in this world and the next, and save me from the punishment of the grave and Hellfire.",
    "O Allah, unite our hearts, reconcile between us, guide us to paths of peace, and save us from darkness into light.",
    "O Allah, bless our Prophet Muhammad and his family and companions, and grant them peace."
  ]
}