{
  "quotes": [
    "The best among you are those who have the best manners.",
    "Patience is a pillar of faith.",
    "Kindness is a mark of faith.",
    "Allah does not burden a soul beyond that it can bear.",
    "The strongest among you is the one who controls his anger.",
    "Seek knowledge from the cradle to the grave.",
    "A smile is charity.",
    "The best of you are those who are best to their families.",
    "Cleanliness is half of faith.",
    "The ink of the scholar is more sacred than the blood of the martyr.",
    "He who is not grateful to people is not grateful to Allah.",
    "The world is the prison of the believer and the paradise of the disbeliever.",
    "When you see a person who has been given more than you in money and beauty, look to those who have been given less.",
    "Do not be people without minds of your own, saying that if others treat you well you will treat them well, and that if they do wrong you will do wrong. Instead, accustom yourselves to do good if people do good and not to do wrong if they do evil.",
    "The most perfect believer in faith is the one who is best in manners.",
    "He who believes in Allah and the Last Day should either speak good or keep silent.",
    "The most beloved of people to Allah are those who are most beneficial to people.",
    "Allah is beautiful and loves beauty.",
    "The search for knowledge is obligatory upon every Muslim.",
    "The best of you are those who learn the Quran and teach it.",
    "Modesty brings nothing but good.",
    "Actions are judged by intentions.",
    "The believer is not stung twice from the same hole.",
    "Allah is gentle and loves gentleness in all things.",
    "The best charity is that given when one is healthy and close-fisted.",
    "Whoever treads a path in search of knowledge, Allah will make easy for him the path to Paradise.",
    "The best of you are those who are best to their wives.",
    "He who does not thank people does not thank Allah.",
    "Make things easy and do not make things difficult.",
    "The best of you are those who are best in paying off debt.",
    "The most hated of permissible things to Allah is divorce.",
    "Feed the hungry, visit the sick, and free the captives.",
    "The world is sweet and green, and Allah has put you in charge of it.",
    "Do not be angry.",
    "The greatest jihad is to battle your own soul, to fight the evil within yourself.",
    "Richness is not having many possessions, but richness is being content with oneself.",
    "The most excellent jihad is that for the conquest of self.",
    "Paradise lies at the feet of your mother.",
    "The best of you is he who is best to his family.",
    "The best house among the Muslims is one which contains an orphan who is well treated.",
    "The best of you is he who learns the Quran and teaches it.",
    "The best of you are those who are best to their families, and I am the best to my family.",
    "The best of you are those who are best in character.",
    "He who does not show mercy to our young ones and respect to our old ones is not one of us.",
    "The best of you are those who are best in paying off debt.",
    "The best of you are those who are best in morals.",
    "The best of you are those who are best to their wives.",
    "The best of you are those who are best in character, and the best of you are those who are best to their families.",
    "The best of you are those who are best in paying off their debt.",
    "The best of you are those who are best to their families, and I am the best to my family."
  ]
}